<template>
    <div id="comand" class="comand center">
        <div class="comand__text">
            <h1 class="comand__text_title">наша команда</h1>
            <p class="comand__text_desk">Безопасность наших походов занимает первое место,
                поэтому в каждой группе предусмотрен инструктор высшей категории,
                за плечами которого большое количество выездов, групповых походов,
                сплавов и подъёмов!</p>
        </div>

        <div class="comand__cards">
            <div class="comand__card">
                <img src="../assets/photo_instructor1.jpg" alt="gid" class="comand__card_img">
                <img src="../assets/name_couch1.svg" alt="couch_name" class="comand__card_name_img">
                <div class="skill">
                    <p class="skil_name skill_text">> 15 лет опыта </p>
                    <p class="skil_time skill_text">35 лет</p>
                </div>
                <div class="comand__card_text">
                    <div class="comand__card_text_title">
                        <h1 class="comand__card_text_titl_el">основатель клуба</h1>
                        <a href="#" class="comand__card_text_titl_el_link"><svg class="email"
                                xmlns="http://www.w3.org/2000/svg" width="31" height="31" viewBox="0 0 31 31" fill="none">
                                <path
                                    d="M16.4301 2.62207C14.5823 2.48756 12.7273 2.75249 10.991 3.39883C9.25472 4.04517 7.67797 5.05778 6.36794 6.36781C5.0579 7.67785 4.04529 9.25459 3.39895 10.9909C2.75261 12.7271 2.48769 14.5822 2.62219 16.43C3.08719 23.2629 9.05469 28.4166 15.9005 28.4166H20.6668C21.3772 28.4166 21.9584 27.8354 21.9584 27.125C21.9584 26.4146 21.3772 25.8333 20.6668 25.8333H15.9264C11.1084 25.8333 6.69094 22.7075 5.48969 18.0446C3.56511 10.5529 10.5401 3.56499 18.0318 5.50249C22.7076 6.69082 25.8334 11.1083 25.8334 15.9262V17.3471C25.8334 18.3675 24.9164 19.375 23.8959 19.375C22.8755 19.375 21.9584 18.3675 21.9584 17.3471V15.7325C21.9584 12.4904 19.6593 9.57124 16.4559 9.11915C15.4368 8.96761 14.3961 9.06172 13.4207 9.39365C12.4452 9.72559 11.5632 10.2857 10.848 11.0275C10.1328 11.7692 9.6051 12.6711 9.3089 13.658C9.0127 14.6449 8.95655 15.6883 9.14511 16.7012C9.37165 17.9218 9.94546 19.0512 10.7977 19.9538C11.65 20.8565 12.7445 21.4942 13.9501 21.7904C16.3268 22.3458 18.5872 21.5837 20.0726 20.0725C21.2222 21.6483 23.5214 22.475 25.6268 21.6354C27.3576 20.9508 28.4168 19.1812 28.4168 17.3212V15.9133C28.4168 9.05457 23.263 3.08707 16.4301 2.62207ZM15.5001 19.375C13.3559 19.375 11.6251 17.6442 11.6251 15.5C11.6251 13.3558 13.3559 11.625 15.5001 11.625C17.6443 11.625 19.3751 13.3558 19.3751 15.5C19.3751 17.6442 17.6443 19.375 15.5001 19.375Z"
                                    fill="black" />
                            </svg></a>
                    </div>
                    <div class="comand__card_text_post">
                        <div class="post__collection">
                            <p class="comand__card_text_post_el">инструктор высшей категории</p>
                            <p class="comand__card_text_post_el">главный проводник</p>
                            <p class="comand__card_text_post_el">гид клуба</p>
                        </div>
                        <a href="#" class="comand__card_text_post_el_link"><svg class="whatsup"
                                xmlns="http://www.w3.org/2000/svg" width="31" height="31" viewBox="0 0 31 31" fill="none">
                                <path fill-rule="evenodd" clip-rule="evenodd"
                                    d="M25.0663 5.92349C23.8182 4.67478 22.3354 3.68528 20.7033 3.01193C19.0713 2.33858 17.3221 1.99469 15.5566 2.00006C8.14731 2.00006 2.11571 8.00152 2.1127 15.3795C2.10942 17.7288 2.72869 20.037 3.90747 22.0692L2 29L9.12666 27.1395C11.0994 28.2082 13.3076 28.7675 15.5512 28.7668H15.5566C22.9653 28.7668 28.9963 22.7647 29 15.3873C29.0044 13.6278 28.659 11.885 27.9837 10.2603C27.3083 8.63559 26.3166 7.16139 25.0663 5.92349ZM15.5566 26.5085H15.5518C13.5518 26.5091 11.5881 25.9739 9.86494 24.9584L9.45693 24.7174L5.22794 25.8215L6.35676 21.7179L6.09098 21.296C4.97264 19.5254 4.38012 17.4737 4.38238 15.3795C4.38238 9.24846 9.39727 4.2601 15.5608 4.2601C18.5176 4.25482 21.3553 5.42419 23.45 7.51101C25.5446 9.59784 26.7245 12.4312 26.7303 15.3879C26.7279 21.5196 21.7154 26.5085 15.5566 26.5085ZM21.6853 18.1801C21.3496 18.0126 19.6964 17.2038 19.3903 17.0923C19.0841 16.9808 18.8581 16.9248 18.6345 17.2598C18.4109 17.5949 17.7666 18.3447 17.5708 18.5707C17.3749 18.7967 17.179 18.8214 16.8433 18.6538C16.5077 18.4863 15.4246 18.1337 14.1415 16.9947C13.1429 16.1081 12.4691 15.0137 12.2732 14.6792C12.0774 14.3447 12.2521 14.1633 12.4203 13.997C12.5716 13.8469 12.756 13.6064 12.9241 13.4112C13.0923 13.2159 13.1483 13.0761 13.2598 12.8531C13.3713 12.6301 13.3159 12.4348 13.2321 12.2679C13.1483 12.1009 12.4763 10.455 12.1967 9.78544C11.9237 9.13335 11.6471 9.22194 11.4409 9.2117C11.2451 9.20205 11.0191 9.19964 10.7967 9.19964C10.6267 9.20407 10.4594 9.24349 10.3053 9.31546C10.1512 9.38742 10.0136 9.49038 9.9011 9.6179C9.59314 9.95299 8.72528 10.763 8.72528 12.4071C8.72528 14.0512 9.93064 15.6423 10.097 15.8653C10.2633 16.0882 12.4655 19.465 15.8351 20.9133C16.4608 21.1812 17.1001 21.4162 17.7504 21.6172C18.555 21.8715 19.2872 21.836 19.8658 21.7498C20.5112 21.654 21.8546 20.941 22.1337 20.1599C22.4127 19.3789 22.4133 18.7099 22.3295 18.5707C22.2457 18.4315 22.0216 18.3471 21.6853 18.1801Z"
                                    fill="black" />
                            </svg></a>
                    </div>
                    <div class="comand__card_text_desc">
                        <p class="comand__card_text_desc_text">Количество пройденных экспедиций - более 50,
                            также Андрей занимается сплавами и подъемами в горы.</p>
                    </div>

                </div>
            </div>
            <div class="comand__card">
                <img src="../assets/photo_instructor2.jpg" alt="gid" class="comand__card_img">
                <img src="../assets/name_couch2.svg" alt="" class="comand__card_name_img">
                <div class="skill">
                    <p class="skil_name skill_text">> 10 лет опыта </p>
                    <p class="skil_time skill_text">29 лет</p>
                </div>
                <div class="comand__card_text">
                    <div class="comand__card_text_title">
                        <h1 class="comand__card_text_titl_el">главный гид клуба</h1>
                        <a href="#" class="comand__card_text_titl_el_link"><svg class="email"
                                xmlns="http://www.w3.org/2000/svg" width="31" height="31" viewBox="0 0 31 31" fill="none">
                                <path
                                    d="M16.4301 2.62207C14.5823 2.48756 12.7273 2.75249 10.991 3.39883C9.25472 4.04517 7.67797 5.05778 6.36794 6.36781C5.0579 7.67785 4.04529 9.25459 3.39895 10.9909C2.75261 12.7271 2.48769 14.5822 2.62219 16.43C3.08719 23.2629 9.05469 28.4166 15.9005 28.4166H20.6668C21.3772 28.4166 21.9584 27.8354 21.9584 27.125C21.9584 26.4146 21.3772 25.8333 20.6668 25.8333H15.9264C11.1084 25.8333 6.69094 22.7075 5.48969 18.0446C3.56511 10.5529 10.5401 3.56499 18.0318 5.50249C22.7076 6.69082 25.8334 11.1083 25.8334 15.9262V17.3471C25.8334 18.3675 24.9164 19.375 23.8959 19.375C22.8755 19.375 21.9584 18.3675 21.9584 17.3471V15.7325C21.9584 12.4904 19.6593 9.57124 16.4559 9.11915C15.4368 8.96761 14.3961 9.06172 13.4207 9.39365C12.4452 9.72559 11.5632 10.2857 10.848 11.0275C10.1328 11.7692 9.6051 12.6711 9.3089 13.658C9.0127 14.6449 8.95655 15.6883 9.14511 16.7012C9.37165 17.9218 9.94546 19.0512 10.7977 19.9538C11.65 20.8565 12.7445 21.4942 13.9501 21.7904C16.3268 22.3458 18.5872 21.5837 20.0726 20.0725C21.2222 21.6483 23.5214 22.475 25.6268 21.6354C27.3576 20.9508 28.4168 19.1812 28.4168 17.3212V15.9133C28.4168 9.05457 23.263 3.08707 16.4301 2.62207ZM15.5001 19.375C13.3559 19.375 11.6251 17.6442 11.6251 15.5C11.6251 13.3558 13.3559 11.625 15.5001 11.625C17.6443 11.625 19.3751 13.3558 19.3751 15.5C19.3751 17.6442 17.6443 19.375 15.5001 19.375Z"
                                    fill="black" />
                            </svg></a>
                    </div>
                    <div class="comand__card_text_post">
                        <div class="post__collection">
                            <p class="comand__card_text_post_el">инструктор высшей категории</p>
                            <p class="comand__card_text_post_el">проводник</p>
                            <p class="comand__card_text_post_el">главный гид клуба</p>
                        </div>
                        <a href="#" class="comand__card_text_post_el_link"><svg class="whatsup"
                                xmlns="http://www.w3.org/2000/svg" width="31" height="31" viewBox="0 0 31 31" fill="none">
                                <path fill-rule="evenodd" clip-rule="evenodd"
                                    d="M25.0663 5.92349C23.8182 4.67478 22.3354 3.68528 20.7033 3.01193C19.0713 2.33858 17.3221 1.99469 15.5566 2.00006C8.14731 2.00006 2.11571 8.00152 2.1127 15.3795C2.10942 17.7288 2.72869 20.037 3.90747 22.0692L2 29L9.12666 27.1395C11.0994 28.2082 13.3076 28.7675 15.5512 28.7668H15.5566C22.9653 28.7668 28.9963 22.7647 29 15.3873C29.0044 13.6278 28.659 11.885 27.9837 10.2603C27.3083 8.63559 26.3166 7.16139 25.0663 5.92349ZM15.5566 26.5085H15.5518C13.5518 26.5091 11.5881 25.9739 9.86494 24.9584L9.45693 24.7174L5.22794 25.8215L6.35676 21.7179L6.09098 21.296C4.97264 19.5254 4.38012 17.4737 4.38238 15.3795C4.38238 9.24846 9.39727 4.2601 15.5608 4.2601C18.5176 4.25482 21.3553 5.42419 23.45 7.51101C25.5446 9.59784 26.7245 12.4312 26.7303 15.3879C26.7279 21.5196 21.7154 26.5085 15.5566 26.5085ZM21.6853 18.1801C21.3496 18.0126 19.6964 17.2038 19.3903 17.0923C19.0841 16.9808 18.8581 16.9248 18.6345 17.2598C18.4109 17.5949 17.7666 18.3447 17.5708 18.5707C17.3749 18.7967 17.179 18.8214 16.8433 18.6538C16.5077 18.4863 15.4246 18.1337 14.1415 16.9947C13.1429 16.1081 12.4691 15.0137 12.2732 14.6792C12.0774 14.3447 12.2521 14.1633 12.4203 13.997C12.5716 13.8469 12.756 13.6064 12.9241 13.4112C13.0923 13.2159 13.1483 13.0761 13.2598 12.8531C13.3713 12.6301 13.3159 12.4348 13.2321 12.2679C13.1483 12.1009 12.4763 10.455 12.1967 9.78544C11.9237 9.13335 11.6471 9.22194 11.4409 9.2117C11.2451 9.20205 11.0191 9.19964 10.7967 9.19964C10.6267 9.20407 10.4594 9.24349 10.3053 9.31546C10.1512 9.38742 10.0136 9.49038 9.9011 9.6179C9.59314 9.95299 8.72528 10.763 8.72528 12.4071C8.72528 14.0512 9.93064 15.6423 10.097 15.8653C10.2633 16.0882 12.4655 19.465 15.8351 20.9133C16.4608 21.1812 17.1001 21.4162 17.7504 21.6172C18.555 21.8715 19.2872 21.836 19.8658 21.7498C20.5112 21.654 21.8546 20.941 22.1337 20.1599C22.4127 19.3789 22.4133 18.7099 22.3295 18.5707C22.2457 18.4315 22.0216 18.3471 21.6853 18.1801Z"
                                    fill="black" />
                            </svg></a>
                    </div>
                    <div class="comand__card_text_desc">
                        <p class="comand__card_text_desc_text">Количество пройденных экспедиций - более 30, также Жанна
                            занимается подъемами в горы и учится
                            в медицинском вузе.</p>
                    </div>

                </div>
            </div>
            <div class="comand__card comand__card_invise">
                <img src="../assets/photo_instructor3.jpg" alt="gid" class="comand__card_img">
                <img src="../assets/name_couch3.svg" alt="" class="comand__card_name_img">
                <div class="skill">
                    <p class="skil_name skill_text">> 12 лет опыта </p>
                    <p class="skil_time skill_text">30 лет</p>
                </div>
                <div class="comand__card_text">
                    <div class="comand__card_text_title">
                        <h1 class="comand__card_text_titl_el">капитан клуба</h1>
                        <a href="#" class="comand__card_text_titl_el_link"><svg class="email"
                                xmlns="http://www.w3.org/2000/svg" width="31" height="31" viewBox="0 0 31 31" fill="none">
                                <path
                                    d="M16.4301 2.62207C14.5823 2.48756 12.7273 2.75249 10.991 3.39883C9.25472 4.04517 7.67797 5.05778 6.36794 6.36781C5.0579 7.67785 4.04529 9.25459 3.39895 10.9909C2.75261 12.7271 2.48769 14.5822 2.62219 16.43C3.08719 23.2629 9.05469 28.4166 15.9005 28.4166H20.6668C21.3772 28.4166 21.9584 27.8354 21.9584 27.125C21.9584 26.4146 21.3772 25.8333 20.6668 25.8333H15.9264C11.1084 25.8333 6.69094 22.7075 5.48969 18.0446C3.56511 10.5529 10.5401 3.56499 18.0318 5.50249C22.7076 6.69082 25.8334 11.1083 25.8334 15.9262V17.3471C25.8334 18.3675 24.9164 19.375 23.8959 19.375C22.8755 19.375 21.9584 18.3675 21.9584 17.3471V15.7325C21.9584 12.4904 19.6593 9.57124 16.4559 9.11915C15.4368 8.96761 14.3961 9.06172 13.4207 9.39365C12.4452 9.72559 11.5632 10.2857 10.848 11.0275C10.1328 11.7692 9.6051 12.6711 9.3089 13.658C9.0127 14.6449 8.95655 15.6883 9.14511 16.7012C9.37165 17.9218 9.94546 19.0512 10.7977 19.9538C11.65 20.8565 12.7445 21.4942 13.9501 21.7904C16.3268 22.3458 18.5872 21.5837 20.0726 20.0725C21.2222 21.6483 23.5214 22.475 25.6268 21.6354C27.3576 20.9508 28.4168 19.1812 28.4168 17.3212V15.9133C28.4168 9.05457 23.263 3.08707 16.4301 2.62207ZM15.5001 19.375C13.3559 19.375 11.6251 17.6442 11.6251 15.5C11.6251 13.3558 13.3559 11.625 15.5001 11.625C17.6443 11.625 19.3751 13.3558 19.3751 15.5C19.3751 17.6442 17.6443 19.375 15.5001 19.375Z"
                                    fill="black" />
                            </svg></a>
                    </div>
                    <div class="comand__card_text_post">
                        <div class="post__collection">
                            <p class="comand__card_text_post_el">инструктор высшей категории</p>
                            <p class="comand__card_text_post_el">проводник</p>
                            <p class="comand__card_text_post_el">гид клуба</p>
                        </div>
                        <a href="#" class="comand__card_text_post_el_link"><svg class="whatsup"
                                xmlns="http://www.w3.org/2000/svg" width="31" height="31" viewBox="0 0 31 31" fill="none">
                                <path fill-rule="evenodd" clip-rule="evenodd"
                                    d="M25.0663 5.92349C23.8182 4.67478 22.3354 3.68528 20.7033 3.01193C19.0713 2.33858 17.3221 1.99469 15.5566 2.00006C8.14731 2.00006 2.11571 8.00152 2.1127 15.3795C2.10942 17.7288 2.72869 20.037 3.90747 22.0692L2 29L9.12666 27.1395C11.0994 28.2082 13.3076 28.7675 15.5512 28.7668H15.5566C22.9653 28.7668 28.9963 22.7647 29 15.3873C29.0044 13.6278 28.659 11.885 27.9837 10.2603C27.3083 8.63559 26.3166 7.16139 25.0663 5.92349ZM15.5566 26.5085H15.5518C13.5518 26.5091 11.5881 25.9739 9.86494 24.9584L9.45693 24.7174L5.22794 25.8215L6.35676 21.7179L6.09098 21.296C4.97264 19.5254 4.38012 17.4737 4.38238 15.3795C4.38238 9.24846 9.39727 4.2601 15.5608 4.2601C18.5176 4.25482 21.3553 5.42419 23.45 7.51101C25.5446 9.59784 26.7245 12.4312 26.7303 15.3879C26.7279 21.5196 21.7154 26.5085 15.5566 26.5085ZM21.6853 18.1801C21.3496 18.0126 19.6964 17.2038 19.3903 17.0923C19.0841 16.9808 18.8581 16.9248 18.6345 17.2598C18.4109 17.5949 17.7666 18.3447 17.5708 18.5707C17.3749 18.7967 17.179 18.8214 16.8433 18.6538C16.5077 18.4863 15.4246 18.1337 14.1415 16.9947C13.1429 16.1081 12.4691 15.0137 12.2732 14.6792C12.0774 14.3447 12.2521 14.1633 12.4203 13.997C12.5716 13.8469 12.756 13.6064 12.9241 13.4112C13.0923 13.2159 13.1483 13.0761 13.2598 12.8531C13.3713 12.6301 13.3159 12.4348 13.2321 12.2679C13.1483 12.1009 12.4763 10.455 12.1967 9.78544C11.9237 9.13335 11.6471 9.22194 11.4409 9.2117C11.2451 9.20205 11.0191 9.19964 10.7967 9.19964C10.6267 9.20407 10.4594 9.24349 10.3053 9.31546C10.1512 9.38742 10.0136 9.49038 9.9011 9.6179C9.59314 9.95299 8.72528 10.763 8.72528 12.4071C8.72528 14.0512 9.93064 15.6423 10.097 15.8653C10.2633 16.0882 12.4655 19.465 15.8351 20.9133C16.4608 21.1812 17.1001 21.4162 17.7504 21.6172C18.555 21.8715 19.2872 21.836 19.8658 21.7498C20.5112 21.654 21.8546 20.941 22.1337 20.1599C22.4127 19.3789 22.4133 18.7099 22.3295 18.5707C22.2457 18.4315 22.0216 18.3471 21.6853 18.1801Z"
                                    fill="black" />
                            </svg></a>
                    </div>
                    <div class="comand__card_text_desc">
                        <p class="comand__card_text_desc_text">Количество пройденных экспедиций - более 25, также Мария
                            преподает
                            верховую езду и помогает животным.</p>
                    </div>

                </div>
            </div>

        </div>

    </div>
</template>

<script>
export default {
    name: 'CoMand',

    data() {
        return {

        };
    },

    mounted() {

    },

    methods: {

    },
};
</script>

<style lang="scss" scoped>
.comand {
    display: flex;
    flex-wrap: wrap;
    flex-direction: column;
    align-items: center;
    margin-bottom: 64px;
}

.comand__text_desk {
    color: $textColorLack;
    width: 1489px;
    height: 57px;
    flex-shrink: 0;
    text-align: center;
    font-family: Lack;
    font-size: 24px;
    font-style: normal;
    font-weight: 400;
    line-height: normal;
    margin-bottom: 64px;
}

.comand__text_title {
    color: $textColorDisplay;
    margin-bottom: 24px;
    text-align: center;
    font-family: DespairDisplay;
    font-size: 60px;
    font-style: normal;
    font-weight: 700;
    line-height: normal;
    text-transform: uppercase;
    margin-top: 84px;
}

.comand__card {

    width: 326px;
    height: 690px;

}

.comand__cards {
    gap: 98px;
    display: flex;
    flex-direction: row;
    flex-wrap: wrap;
    justify-content: center;
    align-items: center;
}

.skill {
    display: flex;
    flex-direction: row;
    flex-wrap: nowrap;
    justify-content: space-around;
    position: relative;
    bottom: 100px;


    &_text {
        color: $textColorContrast;
        font-family: Lack;
        font-size: 20px;
        font-style: normal;
        font-weight: 400;
        line-height: normal;

    }
}



.comand__card_name_img {
    position: relative;
    bottom: 120px;
    left: 40px;
}


.comand__card_text_title {
    display: flex;
    flex-direction: row;
    flex-wrap: nowrap;
    justify-content: space-between;
    align-items: center;

}

.comand__card_text {
    margin-top: -60px;


}

.comand__card_text_post {
    display: flex;
    flex-direction: row;
    flex-wrap: nowrap;
    justify-content: space-between;
}

.post__collection {
    display: flex;
    flex-direction: column;
    flex-wrap: nowrap;
    align-items: flex-start;
}


.comand__card_text_titl_el {
    color: $textColorDisplay;
    font-family: "Despair Display";
    font-size: 20px;
    font-style: normal;
    font-weight: 700;
    line-height: normal;
    text-transform: uppercase;
}

.comand__card_text_post_el {
    color: $textColorDisplay;
    font-family: Lack;
    font-size: 14px;
    font-style: normal;
    font-weight: 400;
    line-height: normal;
}

.comand__card_text_desc {
    margin-top: 16px;
    display: flex;
    width: 326px;
    height: 64px;
    text-align: left;
}

.comand__card_text_desc_text {
    display: flex;
    color: $textColorDisplay;
    font-family: Lack;
    font-size: 16px;
    font-style: normal;
    font-weight: 400;
    line-height: normal;
}



@media (max-width: 1020px) and (min-width: 766px) {
    .comand__cards {
        flex-direction: column;
    }

    .comand__text_title {
        width: 640px;
        font-size: 32px;
    }

    .comand__text_desk {
        width: 640px;
        height: auto;
        font-size: 20px;
    }
}
@media (max-width: 1040px)and (min-width: 1021px) {
    .comand__cards {
        // flex-direction: column;
    }
    .comand__card_invise{
        display: none;
    }

    .comand__text_title {
        width: 640px;
        font-size: 40px;
    }

    .comand__text_desk {
        width: 600px;
        height: auto;
        font-size: 26px;
    }
}


</style>